console.log(
    `Ваша оценка - 50 баллов 
    Отзыв по пунктам ТЗ:

    Выполненные пункты:
    1) Вёрстка валидная. Для проверки валидности вёрстки используйте сервис https://validator.w3.org/Валидной вёрстке соответствует надпись "Document checking completed. No errors or warnings to show." В таком случае баллы за пункт требований выставляем полностью.Eсли есть предупреждения - warnings, но нет ошибок - errors, выставляем половину баллов за пункт требований. 
    
    2) блок <header> +2 
    
    3) секция Welcome +2
    
    4) секция About +4. Обратите внимание на появление новых элементов в виде стрелок и переход на 5 точек вместо 3х.Не нужно менять расстояние от картинки до точек, нужно оставить 40px. Оценку не снижаем, если сделано по макету (25px).
    
    5) секция Favorites +2 Сделать кнопку own, вместо buy для последней книги. Здесь важно будет соблюсти условие, что, какие кнопки находились в состояние "own" на Desktop, те же кнопки в том же состоянии будут и на Tablet. Если условие соблюдено: +2

    6) секция CoffeShop +4 Оценка снижаться не будет, если при наложении текста, не будет совпадать расположение букв, расстояние между символами, начало и конец строки, а так же орфография. Будут оцениваться межстрочный интервал, шрифт и центрирование блока с текстом по общим правилам. 
    
    7) секция Contacts +4
    
    8) секция LibraryCard +4
    
    9) блок <footer> + 2 
    
    10) нет полосы прокрутки при ширине страницы от 1440рх до 640рх +4.
    
    11) элементы не выходят за пределы окна браузера при ширине страницы от 1440рх до 640рх +4.
    
    12) элементы не наезжают друг на друга при ширине страницы от 1440рх до 640рх +4. Например, меню в хедере должно преобразоваться в бургер-меню до того, как элементы начнут наезжать друг на друга.
    
    13) все что будет происходить на ширине свыше 1440px - не оценивается. Поэтому можно либо растягивать на весь экран, либо оставить центральной колонкой.
    
    14) На ширине экрана 768рх реализовано адаптивное меню +12 (Рекомендуется сделать появление бургер-меню на ширине 1024px): Eсли при ширине страницы в 768рх панель навигации не скрыта, а бургер-иконка не появилась (при этом учитывайте "Особенности проверки адаптивности в DevTools"), то ставим 0 за данный пункт, и дальше его не проверяем. Иначе:
    -Версия Tablet, отступ иконки юзера от правого края - 105px. Такое же расстояние надо сделать и у открытого меню (сейчас там 92px).
    
    15) Сам крест желательно отцентрировать по поцентральной позиции бургер-иконки. Чтобы при переходе из одного состояния в другое ничего не прыгало. Само меню нужно прижать к правому краю целиком. Если иконка юзера не прыгает (не меняет позиции при открытии меню), независимо от величины отступа: +2
    
    16) при нажатии на бургер-иконку плавно появляется адаптивное меню +4
    
    17) размеры открытого бургер-меню соответствуют макету, так же открытое бургер-меню проверяется на PixelPerfect +2
    
    18) при нажатии на крестик, или на область вне меню, адаптивное меню плавно скрывается, уезжая за экран +2

    19) ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям при нажатии, а само адаптивное меню при этом плавно скрывается +2
    `
);